balazsgrill/modembed/pic/core/hu.modembed.pic/device-descriptors/18xxxx/PIC18F43K22.PIC
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="IPR3" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="IPR3" edc:nzwidth="8" edc:por="00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TMR1GIP" edc:desc="" edc:mask="0x1" edc:name="TMR1GIP" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TMR3GIP" edc:desc="" edc:mask="0x1" edc:name="TMR3GIP" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TMR5GIP" edc:desc="" edc:mask="0x1" edc:name="TMR5GIP" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CTMUIP" edc:desc="" edc:mask="0x1" edc:name="CTMUIP" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TX2IP" edc:desc="" edc:mask="0x1" edc:name="TX2IP" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RC2IP" edc:desc="" edc:mask="0x1" edc:name="RC2IP" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BCL2IP" edc:desc="" edc:mask="0x1" edc:name="BCL2IP" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SSP2IP" edc:desc="" edc:mask="0x1" edc:name="SSP2IP" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nn-nnnss" edc:cname="EECON1" edc:desc="" edc:impl="0xdf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uu-0u000" edc:name="EECON1" edc:nzwidth="0x8" edc:por="xx-0x000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RD" edc:desc="" edc:mask="0x1" edc:name="RD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WR" edc:desc="" edc:mask="0x1" edc:name="WR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WREN" edc:desc="" edc:mask="0x1" edc:name="WREN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WRERR" edc:desc="" edc:mask="0x1" edc:name="WRERR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FREE" edc:desc="" edc:mask="0x1" edc:name="FREE" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="CFGS" edc:desc="" edc:mask="0x1" edc:name="CFGS" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EEPGD" edc:desc="" edc:mask="0x1" edc:name="EEPGD" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="wwwwwwww" edc:cname="EECON2" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------" edc:name="EECON2" edc:nzwidth="0x8" edc:por="--------">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="EECON2" edc:desc="" edc:mask="0xff" edc:name="EECON2" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="EEDATA" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="EEDATA" edc:nzwidth="0x8" edc:por="00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="EEDATA" edc:desc="" edc:mask="0xff" edc:name="EEDATA" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="EEADR" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="EEADR" edc:nzwidth="0x8" edc:por="00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="EEADR" edc:desc="" edc:mask="0xff" edc:name="EEADR" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="EEADR0" edc:desc="" edc:mask="0x1" edc:name="EEADR0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EEADR1" edc:desc="" edc:mask="0x1" edc:name="EEADR1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EEADR2" edc:desc="" edc:mask="0x1" edc:name="EEADR2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EEADR3" edc:desc="" edc:mask="0x1" edc:name="EEADR3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EEADR4" edc:desc="" edc:mask="0x1" edc:name="EEADR4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EEADR5" edc:desc="" edc:mask="0x1" edc:name="EEADR5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EEADR6" edc:desc="" edc:mask="0x1" edc:name="EEADR6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EEADR7" edc:desc="" edc:mask="0x1" edc:name="EEADR7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="1"/>
        <edc:SFRDef edc:access="nnnnnrrr" edc:cname="RCSTA1" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000x" edc:name="RCSTA1" edc:nzwidth="0x8" edc:por="0000000x">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="RCSTA"/>
            <edc:LegacyAlias edc:cname="RC1STA"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RX9D" edc:desc="" edc:mask="0x1" edc:name="RX9D" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OERR" edc:desc="" edc:mask="0x1" edc:name="OERR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FERR" edc:desc="" edc:mask="0x1" edc:name="FERR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADDEN" edc:desc="" edc:mask="0x1" edc:name="ADDEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CREN" edc:desc="" edc:mask="0x1" edc:name="CREN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SREN" edc:desc="" edc:mask="0x1" edc:name="SREN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RX9" edc:desc="" edc:mask="0x1" edc:name="RX9" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPEN" edc:desc="" edc:mask="0x1" edc:name="SPEN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="ADEN" edc:desc="" edc:mask="0x1" edc:name="ADEN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="RX9D1" edc:desc="" edc:mask="0x1" edc:name="RX9D1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OERR1" edc:desc="" edc:mask="0x1" edc:name="OERR1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FERR1" edc:desc="" edc:mask="0x1" edc:name="FERR1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADDEN1" edc:desc="" edc:mask="0x1" edc:name="ADDEN1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CREN1" edc:desc="" edc:mask="0x1" edc:name="CREN1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SREN1" edc:desc="" edc:mask="0x1" edc:name="SREN1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RX91" edc:desc="" edc:mask="0x1" edc:name="RX91" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPEN1" edc:desc="" edc:mask="0x1" edc:name="SPEN1" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
